Revit 2024 API
SchemaCommon.UIName Property
 The property labeled "UIName" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string UIName { get; }
Visual Basic
Public Shared ReadOnly Property UIName As String
	Get
Visual C++
public:
static property String^ UIName {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyString".
See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace